content/resume/personal-statement.tex
% Created 2017-10-09 Mon 05:06
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1.0in]{geometry}
\usepackage{titling}
\setlength{\droptitle}{-14ex}
\usepackage{parskip}
\pagenumbering{gobble}
\author{Yeongho Kim}
\date{}
\title{Personal Statement}
\hypersetup{
 pdfauthor={Yeongho Kim},
 pdftitle={Personal Statement},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
\vspace{-4ex}

In 2016, when I joined my current team, I developed a simple dodging game which exploits Deep Q Learning.
In the game, the agent controls a spaceship to avoid a barrage of bullets as long as possible.
It was a 2 week-long project for the new comers of the team.
At the moment of the project, I was fascinated by Deep Q Learning introduced by Atari paper.
Even though 2 weeks seemed short, I decided to challenge myself to follow my curiosity.

After I went over the Atari paper several times, I realized that I lacked the basics to understand Deep Q Learning.
I crammed knowledge on neural networks across blogs, TensorFlow examples, YouTube tutorials.
And then, when I felt a little confident, I analyzed the Deep Q Learning examples on GitHub.
I built many prototypes and ran experiments with tweaking hyper parameters on them.

After all, I managed to finish the project in before the deadline.
The performance of the AI was not as I expected, however it worked okay.
Under some circumstances it could survive for almost a minute.

I packaged the AI as a partner of the player.
The player and the AI control a spaceship in tandem.
It was a weird idea, but my team crew seemed to be inspired by the game.
I was excited by the fact that Data Science can bring innovation to game development.

The experience shown above proves that I can turn my curiosity to something that actually happens.
Thankfully, this trait made me successful throughout my career in many fields. 

When I was in the first year of my professional career, I was in charge of an intelligent matchmaking system for Bubble Fighter.
As for Bubble Fighter, it is an online water gun fight game for kids.
It already had been out for 5 years, however there was no matchmaking system at the time.
Like many other online games, my team desired to gather more player by planting a matchmaking system.

Because I was the only developer interested in Data Science on the team, I was put in charge of the development of the matchmaking system.
I researched TrueSkill. It is an advanced version of the popular Elo rating system.
It is based on many mathematical theories, such as Bayesian inference and Factor graph.
At first, I gave the TrueSkill paper a cursory reading.
It was filled with unrecognizable mathematical notations.
It seemed almost impossible for me to understand the paper and apply it to the game.

Self-learning pressure caused by my curiosity saved me.
I felt an inner drive to understand the paper.
I put a lot of efforts to build mathematical backgrounds even in my free time.
I mostly studied them via YouTube and Khan Academy.
I consolidated my understanding through implementing prototypes.
I wrote lots of tests to prove that it works as expected.
Through this, I could develop the whole matchmaking system gradually.
The matchmaking system called 'Arena' was launched successfully after striving for over 6 months. 

I believe Data Science can create more innovation to gaming industry.
One of my lifetime goals is to develop a unique, innovative game based on Data Science.
I think MCS-DS is the best opportunity for my procession to the goal.
Although I've been doing some Data Science related works, I feel lack of the field's structured knowledge.
I expect to build a solid foundation for Data Science from the course.
After the course, I'm sure that I will become a unique expert of being both a Data Scientist and a Game Developer.
\end{document}
